vegeta-cli/src/vegeta/aeromant/templates/rotor_mrf_installed/org/constant/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case (OpenFOAM.org dialect) — placeholder values are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      MRFProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rotor
{
    cellZone            rotorZone;
    active              yes;
    nonRotatingPatches  (static);    // the pod/airframe stands still where it reaches into the zone
    origin              ({{ROTOR_CENTER}});
    axis                (1 0 0);
    omega               {{OMEGA}};      // rad/s about +x (right-hand rule); sign = rotation parameter
}

// ************************************************************************* //
